# encoding=UTF-8

import time
import hashlib
import requests
import string
import re
import json
import random
from urllib import parse
from fake_useragent import UserAgent


ua = UserAgent(path='/Users/songhuan/path/fake_useragent.json')


def get_by_id(id):
    data = {'40': '腾讯QQ专区', '99': '网络游戏点卡', '50011665': '网游装备/游戏币/帐号/代练', '50010404': '服饰配件/皮带/帽子/围巾', '50011740': '流行男鞋', '30': '男装', '1625': '女士内衣/男士内衣/家居服', '50006843': '女鞋', '16': '女装/女士精品', '50006842': '箱包皮具/热销女包/男包', '50008090': '3C数码配件', '50018222': 'DIY电脑', '1201': 'MP3/MP4/iPod/录音笔', '50007218': '办公设备/耗材/相关服务', '1101': '笔记本电脑', '11': '电脑硬件/显示器/电脑周边', '20': '电玩/配件/游戏/攻略', '50024099': '电子元器件市场', '124852003': '二手数码', '124044001': '品牌台机/品牌一体机/服务器', '50019780': '平板电脑/MID', '50012164': '闪存卡/U盘/存储/移动硬盘', '1512': '手机', '14': '数码相机/单反相机/摄像机', '50018264': '网络设备/网络相关', '50018004': '文具电教/文化用品/商务用品', '50012082': '厨房电器', '50022703': '大家电', '50002768': '个人护理/保健/按摩器材', '122718004': '家庭保健', '50012100': '生活电器', '50011972': '影音电器', '28': 'ZIPPO/瑞士军刀/眼镜', '50010788': '彩妆/香水/美妆工具', '50023282': '美发护发/假发', '1801': '美容护肤/美体/精油', '50013864': '饰品/流行首饰/时尚饰品新', '50468001': '手表', '50011397': '珠宝/钻石/翡翠/黄金', '35': '奶粉/辅食/营养品/零食', '122650005': '童鞋/婴儿鞋/亲子鞋', '50008165': '童装/婴儿装/亲子装', '25': '玩具/童车/益智/积木/模型', '50014812': '婴童用品', '50022517': '孕妇装/孕产妇用品/营养', '50008163': '床上用品', '50020579': '电子/电工', '50020332': '基础建材', '50020808': '家居饰品', '27': '家装主材', '122852001': '居家布艺', '124050001': '全屋定制', '50020611': '商业/办公家具', '50020857': '特色手工艺', '50020485': '五金/工具', '50008164': '住宅家具', '50023804': '装修设计/施工/监理', '50023717': 'OTC药品/医疗器械/计生用品', '50026800': '保健食品/膳食营养补充食品', '122952001': '餐饮具', '124458005': '茶', '2813': '成人用品/情趣用品', '50016349': '厨房/烹饪用具', '50020275': '传统滋补营养品', '50016348': '家庭/个人清洁工具', '122950001': '节庆用品/礼品', '50008141': '酒类', '21': '居家日用', '50026316': '咖啡/麦片/冲饮', '50016422': '粮油米面/南北干货/调味品', '50002766': '零食/坚果/特产', '122928002': '收纳整理', '50050359': '水产肉类/新鲜蔬果/熟食', '50025705': '洗护清洁剂/卫生巾/纸/香薰', '124354002': '电动车/配件/交通工具', '50013886': '户外/登山/野营/旅行用品', '50010728': '运动/瑜伽/健身/球迷用品', '50510002': '运动包/户外包/配件', '50011699': '运动服/休闲服装', '50012029': '运动鞋new', '122684003': '自行车/骑行装备/零配件', '29': '宠物/宠物食品及用品', '50025707': '度假线路/签证送关/旅游服务', '23': '古董/邮币/字画/收藏', '50454031': '景点门票/演艺演出/周边游', '50017300': '乐器/吉他/钢琴/配件', '124484008': '模玩/动漫/周边/cos/桌游', '33': '书籍/杂志/报纸', '50011949': '特价酒店/特色客栈/公寓旅馆', '34': '音乐/影视/明星/音像', '50025111': '本地化生活服务', '50008075': '餐饮美食卡券', '50025110': '电影/演出/体育赛事', '50023575': '房产/租房/新房/二手房/委托服务', '50025004': '个性定制/设计服务/DIY', '50026555': '购物提货券', '50014927': '教育培训', '50025618': '理财', '50014811': '网店/网络服务/软件', '50158001': '网络店铺代金/优惠券', '50007216': '鲜花速递/花卉仿真/绿植园艺', '50019095': '线下消费卡', '123536002': '阿里通信专属类目', '127458007': '搬运/仓储/物流设备', '98': '包装', '127492006': '标准件/零部件/工业耗材', '125102006': '到家业务', '127442006': '纺织面料/辅料/配套', '127508003': '机械设备', '126700003': '家装灯饰光源', '127450004': '金属材料及制品', '126762001': '美容美体仪器', '124468001': '农机/农具/农膜', '124466001': '农用物资', '124844002': '拍卖会专用', '50023724': '其他', '201162107': '汽车零部件/养护/美容/维保', '127876007': '清洗/食品/商业设备', '127484003': '润滑/胶粘/试剂/实验室耗材', '201156706': '商务/设计服务', '124568010': '室内设计师', '120894001': '淘女郎', '127452002': '橡塑材料及制品', '124470001': '畜牧/养殖物资', '201207402': '婴童尿裤', '124242008': '智能设备', '121266001': '众筹', '124698018': '装修服务', '50074001': '摩托车/装备/配件', '26': '汽车用品/电子/清洗/改装', '50024971': '新车/二手车'}
    return data.get(id)

def get_pageInfo(url):

    headers = {
        "Referer":"https://market.m.taobao.com/apps/market/content/index.html?contentId=226749668934",
        "User-Agent": ua.random,
        "upgrade-insecure-requests": "1",
    }


    response = requests.get(url=url,headers=headers)
    # print(response.text)

    info = re.search('mtopjsonp1\((.*)\)', response.text , re.S).group(1)

    info = json.loads(info)

    try:
        rootCategoryId = info.get('data').get('item').get('rootCategoryId')
    except:
        print('****************************')
        print(response.text)
        return  ''
    category = get_by_id(rootCategoryId)

    return category

def get_sign():
    '''
    根据contentId生成sign

    :param contentId:
    :return:
    '''
    contentId = 231851162423
    tk = 'a8e73dd2bea9653e0fab791cf9c8206c'
    data = '{"contentId":"' + str(contentId) + r'","source":"darenhome","type":"h5","params":"{\"sourcePageName\":\"darenhome\"}","business_spm":"a2114l.11283723","track_params":""}'
    t = int(time.time() * 1000)
    strs = tk + "&" + str(t) + "&" + "12574478" + "&" + data
    sign = hashlib.md5(strs.encode(encoding='utf8')).hexdigest()
    # print(details_sign)

    return  t,sign


def get_rootCategoryId(itemId):
    '''
    根据生成sign
    调用请求、解析
    :param contentId:
    :return:
    '''
    data = '{"spm":"a21bo.2017.201867-rmds-3.1.5af911d9QXXtSj","scm":"1007.12807.84406.100200300000004","id":"' + str(itemId) + '","pvid":"ab900c39-3614-4579-b982-8deb0777f4b6","itemNumId":"' + str(itemId) + '","exParams":"{\"spm\":\"a21bo.2017.201867-rmds-3.1.5af911d9QXXtSj\",\"scm\":\"1007.12807.84406.100200300000004\",\"id\":\"' + str(itemId) + '\",\"pvid\":\"ab900c39-3614-4579-b982-8deb0777f4b6\"}","detail_v":"8.0.0","utdid":"1"}'
    t,sign = get_sign()
    parse_data = parse.quote(data)
    details_url = 'https://h5api.m.taobao.com/h5/mtop.taobao.detail.getdetail/6.0/?jsv=2.5.1&appKey=12574478&t={}&sign={}&api=mtop.taobao.detail.getdetail&v=6.0&isSec=0&ecode=0&AntiFlood=true&AntiCreep=true&H5Request=true&ttid=2018%40taobao_h5_9.9.9&type=jsonp&dataType=jsonp&callback=mtopjsonp1&data={}'.format(t,sign,parse_data)
    category = get_pageInfo(details_url)
    return category









if __name__ == '__main__':
    # for contentid in [229630290483, 228368239526, 227793649497, 227598244548, 227838151021, 227837503653, 227743510909, 227675433637, 227670865567, 226749668934, 226758215905, 226567297815, 225538526270, 225280428581, 225353489045, 225333843203, 225118276170, 225335667201, 225190733664, 225038731866, 225047943347, 225047851471, 224805546190, 224805134744, 224857143903]:
    #     get_detailsSign(contentid)
    category = get_rootCategoryId(522069656055) # 570857669382
    print(category)
    # print(get_by_id('50002768'))




